AdvanceC++.org
#+TITLE: Advance C

* Sort
* String
** 作業
- [[https://www.youtube.com/watch?v=vCB_0cFQr5o][First Unique Character in a String]]
* 2D Array
** Array of string
*** CPP
- [[https://www.geeksforgeeks.org/array-strings-c-3-different-ways-create/][Array of Strings in C++ (5 Different Ways to Create)]]
*** C
#+begin_src c -r -n :results output :exports both

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
int main(int argc, const char * argv[]) {
    // insert code here...
    char  poker[53][5];
    char m[4] = {'A','B','C','D'};
    char tmp[5];
    int i, j, k;
    for (i = 0; i < 4; i++) {
        for (j = 0; j < 13; j++) {
            k = 13 * i + j;
            sprintf(tmp, "%d%c", j+1, m[i]);
            //printf("%d: %s\n", k, tmp);
            strcpy(poker[k], tmp);
        }
    }
    for (i = 0; i < 52; i++) {
        printf("%s\n", poker[i]);
    }

    return 0;
}

#+end_src
* Variable
** Global v.s. Local
* Function
** Argument
*** passing array
- [[https://www.youtube.com/watch?v=BggprNmXZGg][【C 語言入門】19.1 - 在函式間傳遞陣列]]
** Recursion
* 指標Pointer
** 指標陣列
- [[https://www.youtube.com/watch?v=U2YvpfE58cM][【C 語言入門】23.2 - 指標與陣列]]
- [[https://www.youtube.com/watch?v=RDWaVN3yKUA][【C 語言入門】25.1 - 指標陣列]]
* 資料結構
** Array
- Find 2's complement: https://www.youtube.com/watch?v=cDCWZ-9ugYM
- First Unique Character in a string: https://www.youtube.com/watch?v=vCB_0cFQr5o
** Stack
** Queue
** Vector: 強化版的陣列
- [[https://mropengate.blogspot.com/2015/07/cc-vector-stl.html][ C/C++ - Vector (STL) 用法與心得完全攻略 ]]
* 演算法
** 回溯法(Backtracking)
- [[https://www.youtube.com/watch?v=nrHTtjkYEyQ][【C++ 資料結構與演算法】回溯法 (backtracking)]]
** 隨機演算法
- [[https://www.youtube.com/watch?v=vdGqFJWAIMg][Majority Element]]
* LeeCode
- [[https://www.youtube.com/watch?v=vdGqFJWAIMg][【C 語言的 LeetCode 五月挑戰】第六天 (Majority Element)]]
  + brute force: for-for
  + random
  + sort
  + hashtable
  + divide and conquer
- [[https://www.youtube.com/watch?v=P8iPMS8cjA8][【C 語言的 LeetCode 五月挑戰】第七天 (Cousins in Binary Tree)]]
  + Binary tree
  + coutn tree depth
- [[https://www.youtube.com/watch?v=9VpaaJ3eLWk&t=11s][【C 語言的 LeetCode 五月挑戰】第八天 (Check If It Is a Straight Line)]]
  +
- [[https://www.youtube.com/watch?v=chNBaZBC2o8&list=PLY_qIufNHc292EYDwe3B6sGYO_vQ7pOLx&index=3][【C 語言的 LeetCode 五月挑戰】第三天 (Ransom Note)]]
  + 1d Array
  + 宇元計數與比對
* Dynamic programming
- [[https://www.youtube.com/watch?v=oBt53YbR9Kk][Dynamic Programming - Learn to Solve Algorithmic Problems & Coding Challenges]]
